src/cfe/osn/InformationRegisters/_СостоянияОповещенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_СостоянияОповещенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочтена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пометка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаОповещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдаленаИзСпискаНовостей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвтоСбросНапоминанияПриПрочтении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСбросаВажности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подзаголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНовости</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/osn/InformationRegisters/_СостоянияОповещенияПользователей/Ext/ManagerModule.bsl
Функция ПолучитьСтруктуруСообщения() Экспорт
    Ст = Новый Структура;
	Ст.Вставить( "ИдентификаторНовости" 			, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Ст.Вставить( "Пользователь" 					, Справочники.Пользователи.ПустаяСсылка() );
	Ст.Вставить( "Наименование" 					, "" );
	Ст.Вставить( "Прочтена" 						, Ложь);
	Ст.Вставить( "Пометка" 							, 0);
	Ст.Вставить( "ОповещениеВключено" 				, Ложь);
	Ст.Вставить( "ДатаНачалаОповещения" 			, Дата(1,1,1,0,0,0));
	Ст.Вставить( "ДатаЗавершения" 					, Дата(1,1,1,0,0,0));
	Ст.Вставить( "УдаленаИзСпискаНовостей" 			, Ложь);
	Ст.Вставить( "АвтоСбросНапоминанияПриПрочтении" , Ложь);
	Ст.Вставить( "Важность" 						, 0);
	Ст.Вставить( "ДатаСбросаВажности" 				, Дата(1,1,1,0,0,0));
	Ст.Вставить( "Подзаголовок" 					, "");
	Ст.Вставить( "ТекстНовости" 					, "");
	Ст.Вставить( "ДополнительныеЗначения" 			, "");
	
	Возврат Ст;

КонецФункции

Функция ПолучитьСтруктуруДополнительныхЗначенийСообщения() Экспорт
	Ст = Новый Структура;
	Ст.Вставить( "ИмяДокумента"   			, "");
	Ст.Вставить( "НомерДокумента" 			, "");
	Ст.Вставить( "ДатаДокумента"  			, Дата(1,1,1,0,0,0));
	Ст.Вставить( "УникальныйИдентификатор" 	, "00000000-0000-0000-0000-000000000000");
	Возврат Ст;
КонецФункции	

Функция ПолучитьСообщениеПоИдентификатору( мИдентификаторНовости ) Экспорт
	
	Если ( ТипЗнч( мИдентификаторНовости ) = Тип("Строка" )) Тогда
		ИдентификаторНовости = Новый УникальныйИдентификатор( мИдентификаторНовости );
	Иначе 	
	    ИдентификаторНовости = мИдентификаторНовости;
	КонецЕсли;	
		
	Ст = РегистрыСведений._СостоянияОповещенияПользователей.ПолучитьСтруктуруСообщения();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	_СостоянияОповещенияПользователей.ИдентификаторНовости КАК ИдентификаторНовости,
	               |	_СостоянияОповещенияПользователей.Пользователь КАК Пользователь,
	               |	_СостоянияОповещенияПользователей.Наименование КАК Наименование,
	               |	_СостоянияОповещенияПользователей.Прочтена КАК Прочтена,
	               |	_СостоянияОповещенияПользователей.Пометка КАК Пометка,
	               |	_СостоянияОповещенияПользователей.ОповещениеВключено КАК ОповещениеВключено,
	               |	_СостоянияОповещенияПользователей.ДатаНачалаОповещения КАК ДатаНачалаОповещения,
	               |	_СостоянияОповещенияПользователей.ДатаЗавершения КАК ДатаЗавершения,
	               |	_СостоянияОповещенияПользователей.УдаленаИзСпискаНовостей КАК УдаленаИзСпискаНовостей,
	               |	_СостоянияОповещенияПользователей.АвтоСбросНапоминанияПриПрочтении КАК АвтоСбросНапоминанияПриПрочтении,
	               |	_СостоянияОповещенияПользователей.Важность КАК Важность,
	               |	_СостоянияОповещенияПользователей.ДатаСбросаВажности КАК ДатаСбросаВажности,
	               |	_СостоянияОповещенияПользователей.Подзаголовок КАК Подзаголовок,
	               |	_СостоянияОповещенияПользователей.ТекстНовости КАК ТекстНовости,
	               |	_СостоянияОповещенияПользователей.ДополнительныеЗначения КАК ДополнительныеЗначения
	               |ИЗ
	               |	РегистрСведений._СостоянияОповещенияПользователей КАК _СостоянияОповещенияПользователей
	               |ГДЕ
	               |	_СостоянияОповещенияПользователей.ИдентификаторНовости = &ИдентификаторНовости";
	
	Запрос.УстановитьПараметр("ИдентификаторНовости",ИдентификаторНовости);
	Результат = Запрос.Выполнить();
	
	Если НЕ ( Результат.Пустой() ) Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Ст,Выборка);
	КонецЕсли;	
	
	Возврат Ст;
КонецФункции	
	
Процедура ЗаписатьИзменениеСостоянияНовостиСервер(ИдентификаторНовости, лкПрочтена, лкПометка, лкОповещениеВключено, лкДатаНачалаОповещения = '00010101', лкТекущийПользователь) Экспорт

	Запись = РегистрыСведений._СостоянияОповещенияПользователей.СоздатьМенеджерЗаписи();
	Запись.Пользователь				= лкТекущийПользователь;
	Запись.ИдентификаторНовости     = ИдентификаторНовости;
	Запись.Прочитать();
	
	
	Если лкДатаНачалаОповещения = '00010101' Тогда
		лкДатаНачалаОповещения		= Запись.ДатаНачалаОповещения;
	КонецЕсли;
	
	// Запись будет ниже. // На тот случай, если были установлены другие свойства.
	// Вдруг новость не выбрана (т.е. ее нет в базе) - перезаполнить менеджер записи и записать.
	Запись.Пользователь         			= лкТекущийПользователь;
	Запись.ИдентификаторНовости             = ИдентификаторНовости;
	Запись.Прочтена             			= лкПрочтена;
	Запись.Пометка             				= лкПометка;
	Запись.ОповещениеВключено   			= лкОповещениеВключено;
	Запись.ДатаНачалаОповещения 			= лкДатаНачалаОповещения;
	Если ( лкПрочтена ) Тогда
		Запись.ДатаЗавершения = ТекущаяДата();
	КонецЕсли;	
	
	Запись.Записать(Истина);

КонецПроцедуры

Функция ПолучитьОповещение(ЗаголовокСообщения, Менеджер) Экспорт
	
	Ст = ПолучитьСтруктуруСообщения();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОповещенияПользователей.ИдентификаторНовости КАК ИдентификаторНовости,
	               |	ОповещенияПользователей.Пользователь КАК Пользователь,
	               |	ОповещенияПользователей.Наименование КАК Наименование,
	               |	ОповещенияПользователей.Прочтена КАК Прочтена,
	               |	ОповещенияПользователей.Пометка КАК Пометка,
	               |	ОповещенияПользователей.ОповещениеВключено КАК ОповещениеВключено,
	               |	ОповещенияПользователей.ДатаНачалаОповещения КАК ДатаНачалаОповещения,
	               |	ОповещенияПользователей.ДатаЗавершения КАК ДатаЗавершения,
	               |	ОповещенияПользователей.УдаленаИзСпискаНовостей КАК УдаленаИзСпискаНовостей,
	               |	ОповещенияПользователей.АвтоСбросНапоминанияПриПрочтении КАК АвтоСбросНапоминанияПриПрочтении,
	               |	ОповещенияПользователей.Важность КАК Важность,
	               |	ОповещенияПользователей.ДатаСбросаВажности КАК ДатаСбросаВажности,
	               |	ОповещенияПользователей.Подзаголовок КАК Подзаголовок,
	               |	ОповещенияПользователей.ТекстНовости КАК ТекстНовости,
	               |	ОповещенияПользователей.ДополнительныеЗначения КАК ДополнительныеЗначения
	               |ИЗ
	               |	РегистрСведений._СостоянияОповещенияПользователей КАК ОповещенияПользователей
	               |ГДЕ
	               |	ОповещенияПользователей.Пользователь = &Пользователь
	               |	И ОповещенияПользователей.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Пользователь",Менеджер);
	Запрос.УстановитьПараметр("Наименование",ЗаголовокСообщения);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ ( Результат.Пустой() ) Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Ст,Выборка);
	КонецЕсли;	
	
	Возврат Ст;
	
КонецФункции // ПолучитьОповещение()

Функция ПолучитьСписокСообщений(Автор) Экспорт
	
	МассивСообщений = Новый Массив;
	
	НаборЗаписей = РегистрыСведений._СостоянияОповещенияПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Автор);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Для Каждого ТекЗапись Из НаборЗаписей Цикл
			Если ТекЗапись.Прочтена Тогда
				Продолжить;
			КонецЕсли;
			
			Ст = ПолучитьСтруктуруСообщения();
			ЗаполнитьЗначенияСвойств(Ст,ТекЗапись);
			
			МассивСообщений.Добавить(Ст);
			
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСообщений;
	
КонецФункции
